# За день машина проезжает n километров. Сколько
# дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя
# пользоваться условной инструкцией if и циклами.
# Input:
# n = 700
# m = 750
# Output:
# 2

# #Мое решение, до препода
# n = int (input("Введите сколько проезжает машина в день: "))
# m = int (input("Введите длину маршрута: "))
# print(type(n))
# print(type(m))
# #result = m / n
# print (int(m/n))
# #print(type(result))

#Препод

# n = int(input())
# m = int(input())

# print((m + n - 1)//n) 

# n = int(input("Введите сколько проедет машина: "))
# m = int(input("Введите расстояние: "))
# print((m+n-1)//n)