# Найдите сумму цифр трехзначного числа. 

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)


n = int(input("Введите число: "))
m = 0
sum = 0
while n != 0:
    m = n % 10
    sum = sum + m
    n = n // 10
print(sum)